results/4-nodes/couchbase/logs.txt
[OVERALL], RunTime(ms), 120061
[OVERALL], Throughput(ops/sec), 51399.805099074634
[TOTAL_GCS_PS_Scavenge], Count, 40
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 540
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.4497713662221704
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 1250
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 1.0411374218105796
[TOTAL_GCs], Count, 41
[TOTAL_GC_TIME], Time(ms), 1790
[TOTAL_GC_TIME_%], Time(%), 1.49090878803275
[READ], Operations, 3085785
[READ], AverageLatency(us), 3957.714676816434
[READ], MinLatency(us), 118
[READ], MaxLatency(us), 3210392
[READ], Return=OK, 3085800
[READ], Return=ERROR, 127
[READ], 0, 6964.219211280018
[READ], 1000, 225.49673142857142
[READ], 2000, 211.85986774033918
[READ], 3000, 205.74252520075174
[READ], 4000, 204.32469473144906
[READ], 5000, 206.9094163981382
[READ], 7000, 616.8629828512039
[READ], 8000, 209.50069192181283
[READ], 9000, 201.88180214981526
[READ], 10000, 942.7802510356768
[READ], 11000, 12432.248218984661
[READ], 12000, 2898.1277097986317
[READ], 13000, 3048.6417849484324
[READ], 14000, 3244.5402147348764
[READ], 15000, 3243.248892729826
[READ], 16000, 3465.7388848449555
[READ], 17000, 3820.637721607307
[READ], 18000, 4061.8617960736365
[READ], 19000, 4094.8711891024545
[READ], 20000, 4254.549971586873
[READ], 21000, 4248.957119452953
[READ], 22000, 4220.351253973861
[READ], 23000, 4254.294004557106
[READ], 24000, 4233.394143266882
[READ], 25000, 4065.15409380507
[READ], 26000, 4352.272043444758
[READ], 27000, 4062.7355545042915
[READ], 28000, 4440.351105859764
[READ], 29000, 4118.41453341525
[READ], 30000, 4072.601233474172
[READ], 31000, 4085.9562395950124
[READ], 32000, 3972.2018080297794
[READ], 33000, 4084.7536685846585
[READ], 34000, 4031.660118744699
[READ], 35000, 4119.995985325673
[READ], 36000, 4474.266661682802
[READ], 37000, 4087.8573969557037
[READ], 38000, 4023.1971068124476
[READ], 39000, 4069.278030560272
[READ], 40000, 4037.219876277569
[READ], 41000, 4009.8509650951646
[READ], 42000, 4084.1146673992926
[READ], 43000, 4032.8511527571795
[READ], 44000, 4025.347880722728
[READ], 45000, 4021.9747415999204
[READ], 46000, 4522.720412246593
[READ], 47000, 4048.1465952510916
[READ], 48000, 4016.5579661472325
[READ], 49000, 4090.3161461703503
[READ], 50000, 4085.0217673149095
[READ], 51000, 4019.770629370629
[READ], 52000, 4079.1363033948414
[READ], 53000, 4053.4340588554383
[READ], 54000, 4043.736080517808
[READ], 55000, 4071.790426645948
[READ], 56000, 4350.48010185522
[READ], 57000, 4076.0853914337913
[READ], 58000, 4142.0066039692965
[READ], 59000, 4051.016043507818
[READ], 60000, 4006.6219044414534
[READ], 61000, 4074.150816684665
[READ], 62000, 4120.279511207222
[READ], 63000, 4050.1214133270096
[READ], 64000, 4058.1419792686634
[READ], 65000, 4023.252676159669
[READ], 66000, 4319.398956975228
[READ], 67000, 4074.202191761514
[READ], 68000, 4070.5472482559367
[READ], 69000, 4146.696477452817
[READ], 70000, 4052.9456881379797
[READ], 71000, 4053.6323424579414
[READ], 72000, 4079.0638343679357
[READ], 73000, 4202.423913882244
[READ], 74000, 4178.991744351399
[READ], 75000, 4203.904078368652
[READ], 76000, 4431.962009646989
[READ], 77000, 4220.6759166699985
[READ], 78000, 4203.852088097244
[READ], 79000, 4232.88870876226
[READ], 80000, 4229.557345125563
[READ], 81000, 4306.457444588221
[READ], 82000, 4249.915079135501
[READ], 83000, 4221.694088466308
[READ], 84000, 4219.643621601673
[READ], 85000, 4260.703300809632
[READ], 86000, 4479.9952268348225
[READ], 87000, 4179.716825707528
[READ], 88000, 4375.106252658443
[READ], 89000, 4241.943631100083
[READ], 90000, 4233.780858492503
[READ], 91000, 4183.118481673258
[READ], 92000, 4202.651922042454
[READ], 93000, 4252.003779165298
[READ], 94000, 4248.872289156627
[READ], 95000, 4333.446861535862
[READ], 96000, 4474.4127843987
[READ], 97000, 4219.129283616188
[READ], 98000, 4208.104405700053
[READ], 99000, 4223.313208477082
[READ], 100000, 4197.472500102078
[READ], 101000, 4211.5595257698005
[READ], 102000, 4241.652565367538
[READ], 103000, 4236.813554428082
[READ], 104000, 4234.907933116963
[READ], 105000, 4210.298734177215
[READ], 106000, 4499.51566084348
[READ], 107000, 4235.138129555998
[READ], 108000, 4247.075456810631
[READ], 109000, 4226.909521261268
[READ], 110000, 4264.7800332088
[READ], 111000, 4269.679388358818
[READ], 112000, 4243.660562215791
[READ], 113000, 4233.7958305757775
[READ], 114000, 4259.945999668709
[READ], 115000, 4242.4726942821735
[UPDATE-FAILED], Operations, 113
[UPDATE-FAILED], AverageLatency(us), 1.0001027115044247E7
[UPDATE-FAILED], MinLatency(us), 10000225
[UPDATE-FAILED], MaxLatency(us), 10018318
[UPDATE-FAILED], 0, 1.0001204818181818E7
[UPDATE-FAILED], 1000, 1.0000512142857144E7
[UPDATE-FAILED], 2000, 1.0000358611111112E7
[CLEANUP], Operations, 250
[CLEANUP], AverageLatency(us), 0.416
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 7
[CLEANUP], 0, 1.4
[CLEANUP], 56000, 1.0
[CLEANUP], 57000, 1.0
[CLEANUP], 61000, 1.0
[CLEANUP], 62000, 1.0909090909090908
[CLEANUP], 63000, 1.0
[CLEANUP], 64000, 1.0
[CLEANUP], 69000, 1.0
[CLEANUP], 70000, 1.0
[CLEANUP], 105000, 0.2669902912621359
[UPDATE], Operations, 3085060
[UPDATE], AverageLatency(us), 3962.0768062857774
[UPDATE], MinLatency(us), 128
[UPDATE], MaxLatency(us), 3204313
[UPDATE], Return=OK, 3085072
[UPDATE], Return=ERROR, 113
[UPDATE], 0, 7546.64616394878
[UPDATE], 1000, 233.5139447695684
[UPDATE], 2000, 229.82622073578597
[UPDATE], 3000, 215.20947417880484
[UPDATE], 4000, 214.1984787661103
[UPDATE], 5000, 216.1434358974359
[UPDATE], 7000, 630.475738887596
[UPDATE], 8000, 217.20004324324324
[UPDATE], 9000, 212.1027074749853
[UPDATE], 10000, 977.3164478954828
[UPDATE], 11000, 11261.858091474474
[UPDATE], 12000, 2903.847492697176
[UPDATE], 13000, 3068.1832111755243
[UPDATE], 14000, 3289.5042795232935
[UPDATE], 15000, 3235.1367738449067
[UPDATE], 16000, 3511.138123961885
[UPDATE], 17000, 3799.161340682448
[UPDATE], 18000, 4069.540920802821
[UPDATE], 19000, 4097.327691729066
[UPDATE], 20000, 4277.28327050288
[UPDATE], 21000, 4265.784688486224
[UPDATE], 22000, 4206.60626507709
[UPDATE], 23000, 4268.724299396949
[UPDATE], 24000, 4261.24107713049
[UPDATE], 25000, 4048.53045325779
[UPDATE], 26000, 4420.4526568991905
[UPDATE], 27000, 4066.326372802834
[UPDATE], 28000, 4432.859294990723
[UPDATE], 29000, 4093.4082821980733
[UPDATE], 30000, 4112.316366001438
[UPDATE], 31000, 4076.9626072742135
[UPDATE], 32000, 4019.5491976280614
[UPDATE], 33000, 4100.518907994793
[UPDATE], 34000, 4091.3804329472155
[UPDATE], 35000, 4153.899683391837
[UPDATE], 36000, 4490.444535835794
[UPDATE], 37000, 4144.371595397562
[UPDATE], 38000, 4023.5028542646073
[UPDATE], 39000, 4061.3566287046738
[UPDATE], 40000, 4081.415525580762
[UPDATE], 41000, 4022.7200761243366
[UPDATE], 42000, 4082.559494785318
[UPDATE], 43000, 4057.6904104979812
[UPDATE], 44000, 4051.0700777896996
[UPDATE], 45000, 4026.700260056064
[UPDATE], 46000, 4541.458457928006
[UPDATE], 47000, 4054.9073200120492
[UPDATE], 48000, 4027.780954298369
[UPDATE], 49000, 4111.000480323875
[UPDATE], 50000, 4055.637046816289
[UPDATE], 51000, 4064.8661479130405
[UPDATE], 52000, 4093.9878564606356
[UPDATE], 53000, 4069.1447194215298
[UPDATE], 54000, 4106.064773886434
[UPDATE], 55000, 4096.187105190882
[UPDATE], 56000, 4361.805743366049
[UPDATE], 57000, 4048.208429639701
[UPDATE], 58000, 4158.889227044787
[UPDATE], 59000, 4060.472855939343
[UPDATE], 60000, 4042.7653044147673
[UPDATE], 61000, 4046.3144450869017
[UPDATE], 62000, 4149.9838174273855
[UPDATE], 63000, 4010.74083857162
[UPDATE], 64000, 4036.6529785222206
[UPDATE], 65000, 4062.4132583503747
[UPDATE], 66000, 4355.125450639088
[UPDATE], 67000, 4110.991212099993
[UPDATE], 68000, 4093.855306035704
[UPDATE], 69000, 4136.287489258092
[UPDATE], 70000, 4095.862136128621
[UPDATE], 71000, 4090.2602364829304
[UPDATE], 72000, 4108.3905664456615
[UPDATE], 73000, 4192.405834422323
[UPDATE], 74000, 4227.248048917853
[UPDATE], 75000, 4205.094096385542
[UPDATE], 76000, 4449.378334103415
[UPDATE], 77000, 4213.1087114777965
[UPDATE], 78000, 4248.746510216468
[UPDATE], 79000, 4237.9852817325045
[UPDATE], 80000, 4252.728104201544
[UPDATE], 81000, 4303.042252931324
[UPDATE], 82000, 4284.017474680391
[UPDATE], 83000, 4243.795622826754
[UPDATE], 84000, 4229.234625833539
[UPDATE], 85000, 4303.51919393788
[UPDATE], 86000, 4466.838495097404
[UPDATE], 87000, 4242.7254362553895
[UPDATE], 88000, 4423.71663596247
[UPDATE], 89000, 4270.8904961246735
[UPDATE], 90000, 4238.015051546392
[UPDATE], 91000, 4240.4966148291005
[UPDATE], 92000, 4235.763463098135
[UPDATE], 93000, 4235.578675162398
[UPDATE], 94000, 4261.97469239949
[UPDATE], 95000, 4301.748392484343
[UPDATE], 96000, 4503.150337098327
[UPDATE], 97000, 4238.225805116317
[UPDATE], 98000, 4255.530298637286
[UPDATE], 99000, 4224.176202593992
[UPDATE], 100000, 4208.873709552373
[UPDATE], 101000, 4249.850373042552
[UPDATE], 102000, 4241.0335426305355
[UPDATE], 103000, 4240.290132850739
[UPDATE], 104000, 4239.31602159845
[UPDATE], 105000, 4217.533541341653
[UPDATE], 106000, 4508.072470690404
[UPDATE], 107000, 4285.407789517299
[UPDATE], 108000, 4259.822670004514
[UPDATE], 109000, 4244.933596642804
[UPDATE], 110000, 4268.521112170058
[UPDATE], 111000, 4269.796013535821
[UPDATE], 112000, 4248.410329218107
[UPDATE], 113000, 4211.505235708756
[UPDATE], 114000, 4273.98334579284
[UPDATE], 115000, 4253.892386368646
[READ-FAILED], Operations, 127
[READ-FAILED], AverageLatency(us), 1.0000757968503937E7
[READ-FAILED], MinLatency(us), 10000250
[READ-FAILED], MaxLatency(us), 10010272
[READ-FAILED], 0, 1.000085967E7
[READ-FAILED], 1000, 1.0000394E7
[READ-FAILED], 2000, 1.0000379086956521E7